# parameters
nc: 10  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [3,4,  4,8,  7,6]
  - [7,12,  14,8,  11,17]  # P3/8
  - [27,14,  21,29,  48,38]  # P4/16
  #- [31,40,  54,29,  82,69]  # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0

   [-1, 1, Conv, [64, 3, 1]],  # 1-P1/2
   [-1, 1, space_to_depth, [1]],
   [-1, 1, Conv, [64, 3, 1]],

   [-1, 1, Conv, [128, 3, 1]],  # 3-P2/4
   [-1, 1, space_to_depth, [1]],
   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 13

   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 16-P3/8
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 26

   [-1, 1, MP, []],
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [[-1, -3], 1, Concat, [1]],  # 29-P4/16
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -3, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [1024, 1, 1]],  # 39

  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 40

   [-1, 1, Conv, [128, 1, 1]],
   [ -1, 1, CARAFE, [ 3,5 ] ],
   [26, 1, Conv, [128, 1, 1]], # route backbone P3  68
   [[-1, -2], 1, Concat, [1]],

   [ -1, 1, Conv, [ 128, 1, 1 ] ],
   [ -2, 1, Conv, [ 128, 1, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 1 ] ],
   [ [ -1, -2, -3, -4, -5, -6], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 128, 1, 1 ] ], #52

   [ -1, 1, Conv, [ 64, 1, 1 ] ],
   [ -1, 1, CARAFE, [ 3,5 ] ],
   [ 13, 1, Conv, [ 64, 1, 1 ] ], # route backbone P2  80
   [ [ -1, -2 ], 1, Concat, [ 1 ] ],

   [ -1, 1, Conv, [ 64, 1, 1 ] ],
   [ -2, 1, Conv, [ 64, 1, 1 ] ],
   [ -1, 1, Conv, [ 32, 3, 1 ] ],
   [ -1, 1, Conv, [ 32, 3, 1 ] ],
   [ -1, 1, Conv, [ 32, 3, 1 ] ],
   [ -1, 1, Conv, [ 32, 3, 1 ] ],
   [ [ -1, -2, -3, -4, -5, -6], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 64, 1, 1 ] ], # 64

   [ -1, 1, MP, [ ] ],
   [ -1, 1, Conv, [ 64, 1, 1 ] ],
   [ -3, 1, Conv, [ 64, 1, 1 ] ],
   [ -1, 1, Conv, [ 64, 3, 2 ] ],
   [ [ -1, -3, 53,43 ], 1, Concat, [ 1 ] ],

   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 77

   [-1, 1, MP, []],
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [[-1, -3, 41], 1, Concat, [1]],

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 90


   [ 64, 1, RepConv, [ 128, 3, 1 ] ],
   [ 77, 1, RepConv, [ 256, 3, 1 ] ],
   [ 90, 1, RepConv, [ 512, 3, 1 ] ],
   #[ 128, 1, RepConv, [ 1024, 3, 1 ] ],


   [[91,92,93], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
